# St7DeleteUnusedProperties

Deletes all unused properties in the specified model.

long St7DeleteUnusedProperties(long uID, long Entity, long* NumDeleted)
Input Parameters
uID
Strand7 model file ID.
Entity
One of ptBEAMPROP, ptPLATEPROP, ptBRICKPROP or ptPLYPROP.
Output Parameters
NumDeleted
Number of properties deleted.